package com.pingwit.part_10.point_1;

public class InterfaceExample {
    public static void main(String[] args) {
        /*
        Это слово вы наверняка уже не раз слышали. Например, интерфейсы есть у большинства компьютерных программ и игр.
        В широком смысле интерфейс некий «пульт», который связывает две взаимодействующие друг с другом стороны.

        Простой пример интерфейса из повседневной жизни автомобиль.
        Вы сидите за рулем, слушаете музыку, переключаете передачи, нажимаете газ и тормоз все это для вас интерфейс.
        Вы не задумываетесь как работает руль, что происходит внутри автомобиля для переключения передачи или
        как обработать радио частоты чтобы у вас играла музыка.
         */
    }
}
