package com.pingwit.part_7;

public class Theory {
    public static void main(String[] args) {
        /*
        Java - это обьективно ориентированный язык програмирования.

        Q; Что такое класс?
        A: Класс - это основная строительная единицы ООП.
        Класс представляет собой шаблон, по которому создаються обьекты.

        Q; Как создать обьект?
        A; При помощи оператора new

        Q; Что такое конструктор?
        A; Это специальный метод класса, который вызывается при создании обьекта (экзимпляра класса)
         */
    }
}
