package com.pingwit.part_9.point_3;

@SuppressWarnings("SpellChekingInspection")
public class EnumTheory {
    public static void main(String[] args) {
        /*
        Enum (перечисление)
        В своей промтейшей форме перечисление предсатвляет собой список именованных констант,
        который определяет новый тип данных и его допустимые значения.
        Таким образом, обьект перечисления может содержать только значения, которые были обьявлены в списке.
        Другие значения не допускаються. Иными словами, перечесление дает возможность явно указывать
        единственные значения, которые может законно иметь тип данных.
         */
    }
}
